Revit 2027 API
OverrideGraphicSettings.InvalidPenNumber Property
 The invalidPenNumber for clearing line weight overrides.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static int InvalidPenNumber { get; }
Public Shared ReadOnly Property InvalidPenNumber As Integer
	Get
public:
static property int InvalidPenNumber {
	int get ();
}
static member InvalidPenNumber : int with get
Property Value
Int32
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace